Revit 2024 API
TableSectionData.IsCellFormattable Method
 Determines whether the cell is formattable or not
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsCellFormattable(
	int nRow,
	int nCol
)
Visual Basic
Public Function IsCellFormattable ( _
	nRow As Integer, _
	nCol As Integer _
) As Boolean
Visual C++
public:
bool IsCellFormattable(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
 The row index of the cell
nCol
Type: System.Int32
 The column index of the cell
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace